(function () {
  window.SCROOGE = {

    CATEGORY: {
      FOOD: 'продукты',
      HOME: 'дом',
      MONTHLY: 'платежи',
      LEISURE: 'досуг',
      HOBBY: 'хобби',
      IMAGE: 'стиль',
      HEALTH: 'здоровье',
      TRANSPORT: 'транспорт',
      E_SIG: 'э-сигареты',
    },

    MONTH_CONVERTER: {
      1:  ['1',  'jan',  'january',   'январь',   'січень'],
      2:  ['2',  'feb',  'february',  'февраль',  'лютий'],
      3:  ['3',  'mar',  'march',     'март',     'березень'],
      4:  ['4',  'apr',  'april',     'апрель',   'квітень'],
      5:  ['5',  'may',  'may',       'май',      'травень'],
      6:  ['6',  'jun',  'june',      'июнь',     'червень'],
      7:  ['7',  'jul',  'july',      'июль',     'липень'],
      8:  ['8',  'aug',  'august',    'август',   'серпень'],
      9:  ['9',  'sep',  'september', 'сентябрь', 'вересень'],
      10: ['10', 'oct',  'october',   'октябрь',  'жовтень'],
      11: ['11', 'nov',  'november',  'ноябрь',   'листопад'],
      12: ['12', 'dec',  'december',  'декабрь',  'грудень'],
    },

    SOURCE_BY_CODE: {
      'card': ['c', 'к'],
      'i-card': ['i', 'і', 'и'],
      '$-card': ['$'],
      'Hori': ['h', 'х'],
    },

    CATEGORY_BY_SHOP: {
      FOOD: [
        'кишеня',
        'велмарт',
        'новус',
        'рынок',
        'живи здорово',
        'билла',
        'варус',
        'сильпо',
      ],
      HOME: [
        'аврора',
        'эпицентр',
      ],
      HOBBY: [
        'steam',
        'велокиев',
      ],
      LEISURE: [
        'магнат',
      ],
      IMAGE: [
        'баул',
      ],
    },

    CATEGORY_BY_KEYWORD: {
      FOOD: [
        'сухофрукты',
        'сулугуни',
        'сыр',
        'курица',
        'продукты ',
        'кофе ',
        'мясо',
        'чернослив',
        'соус',
        'молоко',
        'орехи',
        'еда',
        'яйца',
        'соленья',
        'сладкое',
      ],
      MONTHLY: [
        'квартира',
        'эл-во',
        'электричество',
        'квартплата',
        'интернет',
        'телефон',
      ],
      LEISURE: [
        'кино',
        'кафе',
      ],
    },
  }
}());
